{
    "About": "Về chúng tôi",
    "Policy": "Chính sách",
    "Mission": "Sứ mệnh",
    "Product": "Sản phẩm",
    "Tell us everything": "Hãy cho chúng tôi biết",
    "Contact": "Liên hệ",
    "Do you have any question? Feel free to reach out.": "Bạn có câu hỏi nào không? Đừng ngại liên hệ với chúng tôi.",
    "Let's Chat": "Trò chuyện",
    "Application Security": "Bảo mật ứng dụng",
    "Software Principles": "Nguyên tắc phần mềm",
    "Support Center": "Trung tâm hỗ trợ",
    "Customer Support": "Hỗ trợ khách hàng",
    "Address": "Địa chỉ",
    "Press": "Báo chí",
    "Careers & Culture": "Nghề nghiệp & Văn hóa",
    "Language": "Ngôn ngữ",
    "Explore": "Khám phá",
    "Learn more": "Tìm hiểu thêm",
    "Get started": "Bắt đầu",
    "Submit": "Gửi",
    "Message": "Tin nhắn",
    "Your Message": "Tin nhắn của bạn",
    "Name": "Tên",
    "Your Name": "Tên của bạn",
    "Email": "Email",
    "Your Email": "Email của bạn",
    "Services": "Dịch vụ",
    "Solutions": "Giải pháp",
    "Resources": "Tài nguyên",
    "Blog": "Blog",
    "Menu": "Menu",
    "Get in Touch": "Liên hệ",
    "Ready to start your digital transformation journey? Contact us today to discuss how we can help your business grow.": "Sẵn sàng bắt đầu hành trình chuyển đổi số? Liên hệ với chúng tôi ngay hôm nay để thảo luận về cách chúng tôi có thể giúp doanh nghiệp của bạn phát triển.",
    "Phone": "Điện thoại",
    "Email Address": "Địa chỉ email",
    "Location": "Địa điểm",
    "Follow Us": "Theo dõi chúng tôi",
    "© 2024 TDK Technology Solutions. All rights reserved.": "© 2024 TDK Technology Solutions. Tất cả các quyền được bảo lưu.",
    "Our Mission": "Sứ Mệnh Của Chúng Tôi",
    "To empower businesses with innovative digital solutions that drive growth, efficiency, and success in the digital age. We are committed to delivering excellence in every project and building long-term partnerships with our clients.": "Chúng tôi cam kết mang đến những giải pháp số sáng tạo giúp doanh nghiệp phát triển, nâng cao hiệu quả và thành công trong thời đại số. Chúng tôi luôn nỗ lực đạt được sự xuất sắc trong mọi dự án và xây dựng mối quan hệ đối tác lâu dài với khách hàng.",
    "Contact Us": "Liên Hệ",
    "Our Solutions": "Giải Pháp Của Chúng Tôi",
    "We offer a wide range of digital solutions designed to meet your business needs:": "Chúng tôi cung cấp đa dạng các giải pháp số được thiết kế để đáp ứng nhu cầu kinh doanh của bạn:",
    "Web Development": "Phát Triển Web",
    "Custom websites and web applications built with the latest technologies": "Website và ứng dụng web tùy chỉnh được xây dựng bằng công nghệ mới nhất",
    "Mobile App Development": "Phát Triển Ứng Dụng Di Động",
    "Native and cross-platform mobile applications for iOS and Android": "Ứng dụng di động native và đa nền tảng cho iOS và Android",
    "Game Development": "Phát Triển Game",
    "Game development for all platforms": "Phát triển game cho mọi nền tảng",
    "Digital Marketing": "Tiếp Thị Số",
    "Comprehensive digital marketing strategies to boost your online presence": "Chiến lược tiếp thị số toàn diện để tăng cường sự hiện diện trực tuyến của bạn",
    "View Our Mission": "Xem Sứ Mệnh",
    "Our Services": "Dịch Vụ Của Chúng Tôi",
    "We offer a comprehensive range of digital services including web development, mobile app development, game development, digital marketing, and solutions. Our team of experts is committed to delivering high-quality solutions that drive business growth.": "Chúng tôi cung cấp đa dạng các dịch vụ số bao gồm phát triển web, phát triển ứng dụng di động, phát triển game, tiếp thị số và các giải pháp. Đội ngũ chuyên gia của chúng tôi cam kết mang đến những giải pháp chất lượng cao thúc đẩy tăng trưởng kinh doanh.",
    "View Solutions": "Xem Giải Pháp",
    "About us": "Về Chúng Tôi",
    "TDK is a leading digital transformation company dedicated to helping businesses succeed in the digital world. With years of experience and a team of skilled professionals, we deliver innovative solutions that drive growth and efficiency.": "TDK là công ty hàng đầu về chuyển đổi số, cam kết giúp doanh nghiệp thành công trong thế giới số. Với nhiều năm kinh nghiệm và đội ngũ chuyên gia tài năng, chúng tôi mang đến những giải pháp sáng tạo thúc đẩy tăng trưởng và hiệu quả.",
    "Expertise": "Chuyên Môn",
    "Our team consists of industry experts with deep knowledge in various digital domains.": "Đội ngũ của chúng tôi bao gồm các chuyên gia ngành với kiến thức sâu rộng trong nhiều lĩnh vực số.",
    "Innovation": "Đổi Mới",
    "We stay ahead of the curve by continuously adopting and implementing the latest technologies.": "Chúng tôi luôn đi đầu bằng cách liên tục áp dụng và triển khai các công nghệ mới nhất.",
    "Customer Focus": "Tập Trung Khách Hàng",
    "We prioritize our clients' needs and work closely with them to deliver tailored solutions.": "Chúng tôi ưu tiên nhu cầu của khách hàng và làm việc chặt chẽ với họ để mang đến các giải pháp phù hợp.",
    "Quality Assurance": "Đảm Bảo Chất Lượng",
    "We maintain rigorous quality standards throughout our development process to ensure reliable and robust solutions.": "Chúng tôi duy trì các tiêu chuẩn chất lượng nghiêm ngặt trong suốt quá trình phát triển để đảm bảo các giải pháp đáng tin cậy và vững chắc.",
    "View Services": "Xem Dịch Vụ",
    "TDK": "TDK",
    "Your Trusted Partner in Digital Transformation": "Đối Tác Tin Cậy Trong Chuyển Đổi Số",
    "We specialize in providing innovative digital solutions to help businesses thrive in the digital age. Our team of experts is dedicated to delivering cutting-edge technology solutions tailored to your needs.": "Chúng tôi chuyên cung cấp các giải pháp số sáng tạo để giúp doanh nghiệp phát triển trong thời đại số. Đội ngũ chuyên gia của chúng tôi cam kết mang đến các giải pháp công nghệ tiên tiến phù hợp với nhu cầu của bạn.",
    "Learn More": "Tìm Hiểu Thêm",
    "Business license": "Giấy phép kinh doanh",
    "Business license: 0316115790": "Giấy phép kinh doanh: 0316115790",
    "TDK TECHNOLOGY SOLUTIONS": "Công ty cổ phần giải pháp công nghệ TDK",
    "29/2/1A đường Bình Đông, Phường 15, Quận 8, Tp.Hồ Chí Minh, Việt Nam": "29/2/1A đường Bình Đông, Phường 15, Quận 8, Tp.Hồ Chí Minh, Việt Nam",
    "name": "Tên",
    "email": "Email",
    "message": "Tin nhắn",
    "Error": "Lỗi",
    "Success": "Thành công",
    "Form Values:": "Giá trị biểu mẫu:",
    "Validation Errors:": "Lỗi xác thực:",
    "Form validation failed": "Xác thực biểu mẫu thất bại",
    "Attempting to send email with params:": "Đang thử gửi email với tham số:",
    "Local development detected - simulating email send": "Phát hiện môi trường phát triển cục bộ - đang mô phỏng gửi email",
    "Email would have been sent with these parameters:": "Email sẽ được gửi với các tham số sau:",
    "Error sending email:": "Lỗi khi gửi email:",
    "Failed to send email": "Gửi email thất bại",
    "Your message has been sent successfully! (Simulated in local development)": "Tin nhắn của bạn đã được gửi thành công! (Mô phỏng trong môi trường phát triển cục bộ)",
    "Sending...": "Đang gửi...",
    "Privacy Policy": "Chính Sách Bảo Mật",
    "This privacy policy applies to the Penguin Puzzle app (hereby referred to as \"Application\") for mobile devices that was created by Tran Thien Kien Thuc (hereby referred to as \"Service Provider\") as an Ad Supported service. This service is intended for use \"AS IS\".": "Chính sách bảo mật này áp dụng cho ứng dụng Penguin Puzzle (sau đây gọi là \"Ứng dụng\") dành cho thiết bị di động được tạo bởi Trần Thiện Kiến Thức (sau đây gọi là \"Nhà cung cấp dịch vụ\") như một dịch vụ có hỗ trợ quảng cáo. Dịch vụ này được cung cấp \"NGUYÊN TRẠNG\".",
    "Information Collection and Use": "Thu Thập và Sử Dụng Thông Tin",
    "The Application collects information when you download and use it. This information may include information such as": "Ứng dụng thu thập thông tin khi bạn tải xuống và sử dụng. Những thông tin này có thể bao gồm",
    "Your device's Internet Protocol address (e.g. IP address)": "Địa chỉ Giao thức Internet của thiết bị của bạn (ví dụ: địa chỉ IP)",
    "The pages of the Application that you visit, the time and date of your visit, the time spent on those pages": "Các trang của Ứng dụng mà bạn truy cập, thời gian và ngày truy cập, thời gian dành cho những trang đó",
    "The time spent on the Application": "Thời gian sử dụng Ứng dụng",
    "The operating system you use on your mobile device": "Hệ điều hành bạn sử dụng trên thiết bị di động",
    "Location Information": "Thông Tin Vị Trí",
    "The Application does not gather precise information about the location of your mobile device.": "Ứng dụng không thu thập thông tin chính xác về vị trí của thiết bị di động của bạn.",
    "Contact and Marketing": "Liên Hệ và Tiếp Thị",
    "The Service Provider may use the information you provided to contact you from time to time to provide you with important information, required notices and marketing promotions.": "Nhà cung cấp dịch vụ có thể sử dụng thông tin bạn cung cấp để liên hệ với bạn theo thời gian để cung cấp thông tin quan trọng, thông báo cần thiết và khuyến mãi tiếp thị.",
    "Personal Information": "Thông Tin Cá Nhân",
    "For a better experience, while using the Application, the Service Provider may require you to provide us with certain personally identifiable information. The information that the Service Provider request will be retained by them and used as described in this privacy policy.": "Để có trải nghiệm tốt hơn khi sử dụng Ứng dụng, Nhà cung cấp dịch vụ có thể yêu cầu bạn cung cấp một số thông tin nhận dạng cá nhân. Thông tin mà Nhà cung cấp dịch vụ yêu cầu sẽ được họ lưu giữ và sử dụng như được mô tả trong chính sách bảo mật này.",
    "Third Party Access": "Truy Cập của Bên Thứ Ba",
    "Only aggregated, anonymized data is periodically transmitted to external services to aid the Service Provider in improving the Application and their service. The Service Provider may share your information with third parties in the ways that are described in this privacy statement.": "Chỉ dữ liệu được tổng hợp, ẩn danh được định kỳ truyền đến các dịch vụ bên ngoài để hỗ trợ Nhà cung cấp dịch vụ trong việc cải thiện Ứng dụng và dịch vụ của họ. Nhà cung cấp dịch vụ có thể chia sẻ thông tin của bạn với các bên thứ ba theo cách được mô tả trong tuyên bố về quyền riêng tư này.",
    "Third Party Services Notice": "Thông Báo về Dịch Vụ Bên Thứ Ba",
    "Please note that the Application utilizes third-party services that have their own Privacy Policy about handling data. Below are the links to the Privacy Policy of the third-party service providers used by the Application:": "Xin lưu ý rằng Ứng dụng sử dụng các dịch vụ của bên thứ ba có Chính sách Bảo mật riêng về xử lý dữ liệu. Dưới đây là các liên kết đến Chính sách Bảo mật của các nhà cung cấp dịch vụ bên thứ ba được Ứng dụng sử dụng:",
    "Information Disclosure": "Tiết Lộ Thông Tin",
    "The Service Provider may disclose User Provided and Automatically Collected Information:": "Nhà cung cấp dịch vụ có thể tiết lộ Thông tin do Người dùng Cung cấp và Thông tin Thu thập Tự động:",
    "Legal Compliance": "Tuân Thủ Pháp Luật",
    "as required by law, such as to comply with a subpoena, or similar legal process;": "theo yêu cầu của pháp luật, chẳng hạn như để tuân thủ trát đòi hầu tòa hoặc quy trình pháp lý tương tự;",
    "Protection of Rights": "Bảo Vệ Quyền Lợi",
    "when they believe in good faith that disclosure is necessary to protect their rights, protect your safety or the safety of others, investigate fraud, or respond to a government request;": "khi họ tin tưởng một cách thiện chí rằng việc tiết lộ là cần thiết để bảo vệ quyền lợi của họ, bảo vệ sự an toàn của bạn hoặc của người khác, điều tra gian lận, hoặc phản hồi yêu cầu của chính phủ;",
    "Service Providers": "Nhà Cung Cấp Dịch Vụ",
    "with their trusted services providers who work on their behalf, do not have an independent use of the information we disclose to them, and have agreed to adhere to the rules set forth in this privacy statement.": "với các nhà cung cấp dịch vụ đáng tin cậy làm việc thay mặt họ, không có quyền sử dụng độc lập thông tin chúng tôi tiết lộ cho họ, và đã đồng ý tuân thủ các quy tắc được đặt ra trong tuyên bố về quyền riêng tư này.",
    "Opt-Out Rights": "Quyền Từ Chối",
    "You can stop all collection of information by the Application easily by uninstalling it. You may use the standard uninstall processes as may be available as part of your mobile device or via the mobile application marketplace or network.": "Bạn có thể dễ dàng dừng mọi việc thu thập thông tin của Ứng dụng bằng cách gỡ cài đặt nó. Bạn có thể sử dụng quy trình gỡ cài đặt tiêu chuẩn có sẵn trong thiết bị di động của bạn hoặc thông qua chợ ứng dụng di động hoặc mạng.",
    "Data Retention Policy": "Chính Sách Lưu Giữ Dữ Liệu",
    "The Service Provider will retain User Provided data for as long as you use the Application and for a reasonable time thereafter. If you'd like them to delete User Provided Data that you have provided via the Application, please contact them at thuc.playstore@gmail.com and they will respond in a reasonable time.": "Nhà cung cấp dịch vụ sẽ lưu giữ dữ liệu do Người dùng Cung cấp trong thời gian bạn sử dụng Ứng dụng và một khoảng thời gian hợp lý sau đó. Nếu bạn muốn họ xóa Dữ liệu do Người dùng Cung cấp mà bạn đã cung cấp thông qua Ứng dụng, vui lòng liên hệ với họ tại thuc.playstore@gmail.com và họ sẽ phản hồi trong một khoảng thời gian hợp lý.",
    "Children": "Trẻ Em",
    "The Service Provider does not use the Application to knowingly solicit data from or market to children under the age of 13.": "Nhà cung cấp dịch vụ không sử dụng Ứng dụng để cố ý thu thập dữ liệu hoặc tiếp thị cho trẻ em dưới 13 tuổi.",
    "Children's Privacy": "Quyền Riêng Tư của Trẻ Em",
    "The Application does not address anyone under the age of 13. The Service Provider does not knowingly collect personally identifiable information from children under 13 years of age. In the case the Service Provider discover that a child under 13 has provided personal information, the Service Provider will immediately delete this from their servers. If you are a parent or guardian and you are aware that your child has provided us with personal information, please contact the Service Provider (thuc.playstore@gmail.com) so that they will be able to take the necessary actions.": "Ứng dụng không hướng đến bất kỳ ai dưới 13 tuổi. Nhà cung cấp dịch vụ không cố ý thu thập thông tin nhận dạng cá nhân từ trẻ em dưới 13 tuổi. Trong trường hợp Nhà cung cấp dịch vụ phát hiện ra rằng một trẻ em dưới 13 tuổi đã cung cấp thông tin cá nhân, Nhà cung cấp dịch vụ sẽ ngay lập tức xóa thông tin này khỏi máy chủ của họ. Nếu bạn là phụ huynh hoặc người giám hộ và bạn biết rằng con của bạn đã cung cấp cho chúng tôi thông tin cá nhân, vui lòng liên hệ với Nhà cung cấp dịch vụ (thuc.playstore@gmail.com) để họ có thể thực hiện các hành động cần thiết.",
    "Security": "Bảo Mật",
    "The Service Provider is concerned about safeguarding the confidentiality of your information. The Service Provider provides physical, electronic, and procedural safeguards to protect information the Service Provider processes and maintains.": "Nhà cung cấp dịch vụ quan tâm đến việc bảo vệ tính bảo mật thông tin của bạn. Nhà cung cấp dịch vụ cung cấp các biện pháp bảo vệ vật lý, điện tử và thủ tục để bảo vệ thông tin mà Nhà cung cấp dịch vụ xử lý và duy trì.",
    "Changes": "Thay Đổi",
    "This Privacy Policy may be updated from time to time for any reason. The Service Provider will notify you of any changes to the Privacy Policy by updating this page with the new Privacy Policy. You are advised to consult this Privacy Policy regularly for any changes, as continued use is deemed approval of all changes.": "Chính sách Bảo mật này có thể được cập nhật theo thời gian vì bất kỳ lý do gì. Nhà cung cấp dịch vụ sẽ thông báo cho bạn về bất kỳ thay đổi nào đối với Chính sách Bảo mật bằng cách cập nhật trang này với Chính sách Bảo mật mới. Bạn nên tham khảo Chính sách Bảo mật này thường xuyên để biết bất kỳ thay đổi nào, vì việc tiếp tục sử dụng được coi là chấp thuận tất cả các thay đổi.",
    "Effective Date": "Ngày Hiệu Lực",
    "This privacy policy is effective as of 2025-01-15": "Chính sách bảo mật này có hiệu lực từ ngày 15/01/2025",
    "Your Consent": "Sự Đồng Ý của Bạn",
    "By using the Application, you are consenting to the processing of your information as set forth in this Privacy Policy now and as amended by us.": "Bằng việc sử dụng Ứng dụng, bạn đồng ý với việc xử lý thông tin của bạn như được quy định trong Chính sách Bảo mật này hiện tại và như được chúng tôi sửa đổi.",
    "Contact Us": "Liên Hệ Với Chúng Tôi",
    "If you have any questions regarding privacy while using the Application, or have questions about the practices, please contact the Service Provider via email at": "Nếu bạn có bất kỳ câu hỏi nào về quyền riêng tư khi sử dụng Ứng dụng, hoặc có câu hỏi về các thực hành, vui lòng liên hệ với Nhà cung cấp dịch vụ qua email tại",
    "Let's Connect": "Kết Nối Ngay",
    "Have a project in mind? We're here to help bring your digital vision to life. Reach out to us for a free consultation.": "Bạn có dự án cần thực hiện? Chúng tôi sẵn sàng giúp biến tầm nhìn số của bạn thành hiện thực. Liên hệ ngay để được tư vấn miễn phí.",
    "resources.title": "Tài Nguyên Unity",
    "resources.subtitle": "Tài Sản Phát Triển Game Chuyên Nghiệp",
    "resources.description": "Truy cập bộ sưu tập toàn diện các tài nguyên Unity bao gồm đồ họa 2D, mô hình 3D và công cụ phát triển để đẩy nhanh các dự án phát triển game của bạn.",
    "resources.warning": "⚠️ Những tài sản này chỉ dành cho mục đích học tập và nghiên cứu, không dành cho các dự án thương mại.",
    "resources.search.placeholder": "Tìm kiếm tài sản theo tiêu đề, danh mục hoặc URL tải xuống...",
    "resources.search.clear": "Xóa",
    "resources.search.virtualKeyboard": "Bàn Phím Ảo",
    "resources.search.search": "Tìm Kiếm",
    "resources.search.resultsFound": "Tìm thấy",
    "resources.search.assets": "tài sản",
    "resources.search.matching": "phù hợp với",
    "resources.search.noResults": "Không tìm thấy tài sản nào phù hợp với",
    "resources.search.noResultsSuggestion": "Hãy thử tìm kiếm với các từ khóa khác hoặc duyệt tất cả danh mục ở trên.",
    "resources.error.title": "Cảnh Báo",
    "resources.error.loadingError": "Lỗi Tải Tài Sản",
    "resources.error.fallback": "Sử dụng dữ liệu dự phòng - API Google Sheets không khả dụng",
    "resources.error.loadFailed": "Không thể tải tài sản. Vui lòng kiểm tra cấu hình API của bạn.",
    "resources.virtualKeyboard.title": "Bàn Phím Ảo",
    "resources.virtualKeyboard.close": "Đóng Bàn Phím",
    "resources.virtualKeyboard.space": "Khoảng Trắng",
    "resources.virtualKeyboard.enter": "Enter",
    "assetCard.download": "Tải Xuống",
    "assetCard.viewAsset": "Xem Tài Sản",
    "pagination.showingItems": "Hiển thị {{start}}-{{end}} trong tổng số {{total}} mục",
    "pagination.goToPage": "Đi đến trang:",
    "Terms & Conditions": "Điều Khoản & Điều Kiện",
    "These terms and conditions apply to the Penguin Puzzle app (hereby referred to as \"Application\") for mobile devices that was created by Tran Thien Kien Thuc (hereby referred to as \"Service Provider\") as an Ad Supported service.": "Những điều khoản và điều kiện này áp dụng cho ứng dụng Penguin Puzzle (sau đây gọi là \"Ứng dụng\") dành cho thiết bị di động được tạo bởi Trần Thiện Kiến Thức (sau đây gọi là \"Nhà cung cấp dịch vụ\") như một dịch vụ có hỗ trợ quảng cáo.",
    "Upon downloading or utilizing the Application, you are automatically agreeing to the following terms. It is strongly advised that you thoroughly read and understand these terms prior to using the Application. Unauthorized copying, modification of the Application, any part of the Application, or our trademarks is strictly prohibited. Any attempts to extract the source code of the Application, translate the Application into other languages, or create derivative versions are not permitted. All trademarks, copyrights, database rights, and other intellectual property rights related to the Application remain the property of the Service Provider.": "Khi tải xuống hoặc sử dụng Ứng dụng, bạn tự động đồng ý với các điều khoản sau. Bạn được khuyến nghị mạnh mẽ nên đọc kỹ và hiểu rõ những điều khoản này trước khi sử dụng Ứng dụng. Việc sao chép, sửa đổi trái phép Ứng dụng, bất kỳ phần nào của Ứng dụng, hoặc thương hiệu của chúng tôi bị nghiêm cấm. Mọi nỗ lực trích xuất mã nguồn của Ứng dụng, dịch Ứng dụng sang các ngôn ngữ khác, hoặc tạo ra các phiên bản phái sinh đều không được phép. Tất cả thương hiệu, bản quyền, quyền cơ sở dữ liệu và các quyền sở hữu trí tuệ khác liên quan đến Ứng dụng vẫn thuộc quyền sở hữu của Nhà cung cấp dịch vụ.",
    "The Service Provider is dedicated to ensuring that the Application is as beneficial and efficient as possible. As such, they reserve the right to modify the Application or charge for their services at any time and for any reason. The Service Provider assures you that any charges for the Application or its services will be clearly communicated to you.": "Nhà cung cấp dịch vụ cam kết đảm bảo rằng Ứng dụng có lợi ích và hiệu quả nhất có thể. Do đó, họ có quyền sửa đổi Ứng dụng hoặc tính phí cho dịch vụ của họ bất cứ lúc nào và vì bất kỳ lý do gì. Nhà cung cấp dịch vụ đảm bảo với bạn rằng bất kỳ khoản phí nào cho Ứng dụng hoặc dịch vụ của nó sẽ được thông báo rõ ràng cho bạn.",
    "The Application stores and processes personal data that you have provided to the Service Provider in order to provide the Service. It is your responsibility to maintain the security of your phone and access to the Application. The Service Provider strongly advise against jailbreaking or rooting your phone, which involves removing software restrictions and limitations imposed by the official operating system of your device. Such actions could expose your phone to malware, viruses, malicious programs, compromise your phone's security features, and may result in the Application not functioning correctly or at all.": "Ứng dụng lưu trữ và xử lý dữ liệu cá nhân mà bạn đã cung cấp cho Nhà cung cấp dịch vụ để cung cấp Dịch vụ. Bạn có trách nhiệm duy trì bảo mật cho điện thoại và quyền truy cập vào Ứng dụng. Nhà cung cấp dịch vụ khuyến nghị mạnh mẽ không nên jailbreak hoặc root điện thoại của bạn, điều này liên quan đến việc loại bỏ các hạn chế và giới hạn phần mềm được áp đặt bởi hệ điều hành chính thức của thiết bị. Những hành động như vậy có thể khiến điện thoại của bạn tiếp xúc với phần mềm độc hại, vi-rút, chương trình độc hại, làm tổn hại các tính năng bảo mật của điện thoại và có thể khiến Ứng dụng không hoạt động chính xác hoặc hoàn toàn không hoạt động.",
    "Please note that the Application utilizes third-party services that have their own Terms and Conditions. Below are the links to the Terms and Conditions of the third-party service providers used by the Application:": "Xin lưu ý rằng Ứng dụng sử dụng các dịch vụ của bên thứ ba có Điều khoản và Điều kiện riêng. Dưới đây là các liên kết đến Điều khoản và Điều kiện của các nhà cung cấp dịch vụ bên thứ ba được Ứng dụng sử dụng:",
    "Please be aware that the Service Provider does not assume responsibility for certain aspects. Some functions of the Application require an active internet connection, which can be Wi-Fi or provided by your mobile network provider. The Service Provider cannot be held responsible if the Application does not function at full capacity due to lack of access to Wi-Fi or if you have exhausted your data allowance.": "Xin lưu ý rằng Nhà cung cấp dịch vụ không chịu trách nhiệm về một số khía cạnh. Một số chức năng của Ứng dụng yêu cầu kết nối internet hoạt động, có thể là Wi-Fi hoặc được cung cấp bởi nhà mạng di động của bạn. Nhà cung cấp dịch vụ không thể chịu trách nhiệm nếu Ứng dụng không hoạt động hết công suất do thiếu quyền truy cập Wi-Fi hoặc nếu bạn đã sử dụng hết dữ liệu.",
    "If you are using the application outside of a Wi-Fi area, please be aware that your mobile network provider's agreement terms still apply. Consequently, you may incur charges from your mobile provider for data usage during the connection to the application, or other third-party charges. By using the application, you accept responsibility for any such charges, including roaming data charges if you use the application outside of your home territory (i.e., region or country) without disabling data roaming. If you are not the bill payer for the device on which you are using the application, they assume that you have obtained permission from the bill payer.": "Nếu bạn đang sử dụng ứng dụng bên ngoài khu vực Wi-Fi, xin lưu ý rằng các điều khoản thỏa thuận của nhà mạng di động của bạn vẫn áp dụng. Do đó, bạn có thể phải chịu phí từ nhà cung cấp di động của mình cho việc sử dụng dữ liệu trong quá trình kết nối với ứng dụng, hoặc các khoản phí của bên thứ ba khác. Bằng việc sử dụng ứng dụng, bạn chấp nhận trách nhiệm cho bất kỳ khoản phí nào như vậy, bao gồm phí dữ liệu roaming nếu bạn sử dụng ứng dụng bên ngoài lãnh thổ quê nhà (tức là khu vực hoặc quốc gia) mà không tắt dữ liệu roaming. Nếu bạn không phải là người thanh toán hóa đơn cho thiết bị mà bạn đang sử dụng ứng dụng, họ cho rằng bạn đã có được sự cho phép từ người thanh toán hóa đơn.",
    "Similarly, the Service Provider cannot always assume responsibility for your usage of the application. For instance, it is your responsibility to ensure that your device remains charged. If your device runs out of battery and you are unable to access the Service, the Service Provider cannot be held responsible.": "Tương tự, Nhà cung cấp dịch vụ không thể luôn chịu trách nhiệm về việc sử dụng ứng dụng của bạn. Ví dụ, bạn có trách nhiệm đảm bảo rằng thiết bị của mình vẫn được sạc. Nếu thiết bị của bạn hết pin và bạn không thể truy cập Dịch vụ, Nhà cung cấp dịch vụ không thể chịu trách nhiệm.",
    "In terms of the Service Provider's responsibility for your use of the application, it is important to note that while they strive to ensure that it is updated and accurate at all times, they do rely on third parties to provide information to them so that they can make it available to you. The Service Provider accepts no liability for any loss, direct or indirect, that you experience as a result of relying entirely on this functionality of the application.": "Về trách nhiệm của Nhà cung cấp dịch vụ đối với việc sử dụng ứng dụng của bạn, điều quan trọng cần lưu ý là mặc dù họ nỗ lực đảm bảo rằng nó được cập nhật và chính xác mọi lúc, họ vẫn dựa vào các bên thứ ba để cung cấp thông tin cho họ để họ có thể cung cấp cho bạn. Nhà cung cấp dịch vụ không chịu trách nhiệm về bất kỳ tổn thất nào, trực tiếp hoặc gián tiếp, mà bạn gặp phải do hoàn toàn dựa vào chức năng này của ứng dụng.",
    "The Service Provider may wish to update the application at some point. The application is currently available as per the requirements for the operating system (and for any additional systems they decide to extend the availability of the application to) may change, and you will need to download the updates if you want to continue using the application. The Service Provider does not guarantee that it will always update the application so that it is relevant to you and/or compatible with the particular operating system version installed on your device. However, you agree to always accept updates to the application when offered to you. The Service Provider may also wish to cease providing the application and may terminate its use at any time without providing termination notice to you. Unless they inform you otherwise, upon any termination, (a) the rights and licenses granted to you in these terms will end; (b) you must cease using the application, and (if necessary) delete it from your device.": "Nhà cung cấp dịch vụ có thể muốn cập nhật ứng dụng vào một thời điểm nào đó. Ứng dụng hiện có sẵn theo yêu cầu cho hệ điều hành (và cho bất kỳ hệ thống bổ sung nào họ quyết định mở rộng tính khả dụng của ứng dụng) có thể thay đổi, và bạn sẽ cần tải xuống các bản cập nhật nếu muốn tiếp tục sử dụng ứng dụng. Nhà cung cấp dịch vụ không đảm bảo rằng họ sẽ luôn cập nhật ứng dụng để nó phù hợp với bạn và/hoặc tương thích với phiên bản hệ điều hành cụ thể được cài đặt trên thiết bị của bạn. Tuy nhiên, bạn đồng ý luôn chấp nhận các bản cập nhật cho ứng dụng khi được cung cấp. Nhà cung cấp dịch vụ cũng có thể muốn ngừng cung cấp ứng dụng và có thể chấm dứt việc sử dụng nó bất cứ lúc nào mà không cần thông báo chấm dứt cho bạn. Trừ khi họ thông báo cho bạn khác, khi chấm dứt, (a) các quyền và giấy phép được cấp cho bạn trong các điều khoản này sẽ kết thúc; (b) bạn phải ngừng sử dụng ứng dụng, và (nếu cần thiết) xóa nó khỏi thiết bị của mình.",
    "Changes to These Terms and Conditions": "Thay Đổi Đối Với Các Điều Khoản Và Điều Kiện Này",
    "The Service Provider may periodically update their Terms and Conditions. Therefore, you are advised to review this page regularly for any changes. The Service Provider will notify you of any changes by posting the new Terms and Conditions on this page.": "Nhà cung cấp dịch vụ có thể định kỳ cập nhật Điều khoản và Điều kiện của họ. Do đó, bạn được khuyến nghị xem xét trang này thường xuyên để biết bất kỳ thay đổi nào. Nhà cung cấp dịch vụ sẽ thông báo cho bạn về bất kỳ thay đổi nào bằng cách đăng Điều khoản và Điều kiện mới trên trang này.",
    "These terms and conditions are effective as of 2025-01-15": "Những điều khoản và điều kiện này có hiệu lực từ ngày 15/01/2025",
    "If you have any questions or suggestions about the Terms and Conditions, please do not hesitate to contact the Service Provider at": "Nếu bạn có bất kỳ câu hỏi hoặc đề xuất nào về Điều khoản và Điều kiện, vui lòng đừng ngại liên hệ với Nhà cung cấp dịch vụ tại",
    "Page Not Found": "Không Tìm Thấy Trang",
    "The page you are looking for might have been removed, had its name changed, or is temporarily unavailable.": "Trang bạn đang tìm kiếm có thể đã bị xóa, đổi tên hoặc tạm thời không khả dụng.",
    "Go to Homepage": "Về Trang Chủ",
    "Go Back": "Quay Lại"
}